ruby-event-me/app/views/inspos/results.html.erb

SELECT "friends".* FROM "friends"
---
<%= f.select(:friend_id) do %>
  <% Friend.all.each do |c| -%>