ruby-event-me/app/controllers/friends_controller.rb

	def index

		@friends = Friend.order(dob: :desc)
---
SELECT "friends".* FROM "friends" ORDER BY "friends"."dob" DESC

	def show
		@inspos = Inspo.where(friend_id: params[:id])
---
SELECT  "inspos".* FROM "inspos" WHERE "inspos"."friend_id" IS NULL LIMIT $1  [["LIMIT", 1]]

	def create
		@friend = Friend.new(friend_params)

		if @friend.valid?
			@friend.save
---
INSERT INTO "friends" ("name", "dob", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Harry Potter"], ["dob", "1990-03-12"], ["notes", "likes grasshoppers"], ["created_at", "2017-11-15 01:21:30.465077"], ["updated_at", "2017-11-15 01:21:30.465077"]]

	def update
		if @friend.update(friend_params)
---
UPDATE "friends" SET "notes" = $1, "updated_at" = $2 WHERE "friends"."id" = $3  [["notes", "Enjoys sour cherry pie and juicy steak dinners. Needs new shoes"], ["updated_at", "2017-11-15 01:20:58.661012"], ["id", 1]]