ruby-event-me/app/controllers/inspos_controller.rb

SELECT "inspos".* FROM "inspos"
---
	def index
		@inspos = Inspo.all

INSERT INTO "inspos" ("friend_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
	def create
		friend_id = params[:friend_id]
		puts friend_id
		@inspo = Inspo.new(inspo_params)

		unless @inspo.save