ruby-event-me/app/controllers/user_controller.rb

INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if @user.save